app/controllers/invoices_controller.rb

SELECT  "invoices".* FROM "invoices" WHERE "invoices"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    @invoice = Invoice.find(params[:id])

INSERT INTO "invoices" ("rent", "created_at", "updated_at") VALUES (?, ?, ?)  [["rent", 10000.0], ["created_at", "2018-04-10 05:54:25.383892"], ["updated_at", "2018-04-10 05:54:25.383892"]]
---
  def create
    @invoice = Invoice.new(invoice_params)

    if @invoice.save